// P2105 收集樱花
// 题目描述
// 学校的樱花大道上有 n 棵樱花树排成一排，其中第 i 棵树上的樱花数量为
// ai。你的任务是选择连续的一段樱花树并收集树上面全部的樱花。从一棵树上取走部分的樱花是不被允许的行为，从不相邻的树上取走樱花也是不被允许的行为。

// 用来装樱花的袋子容量为
// V，你希望能收集到尽可能多的樱花但是又不造成任何的浪费，请问如何选择连续的一段樱花树，可以使得你收获的樱花数量最多且不超过
// V？

// 输入描述
// 输入第一行是两个正整数 n, V，用空格隔开，表示樱花树的数量和袋子的容量。

// 第二行是 n 个不大于 1000 的正整数 a1, a2, ..., an，用空格隔开，其中 ai 表示第 i 棵树上的樱花数量。

// 对于第一个测试点：n, V ≤ 1000

// 对于第二个测试点：n, V ≤ 2e5，保证对于任意的 ai 均满足 ai × 1000 > V

// 对于后两个测试点：n, V ≤ 2e5

// 输出描述
// 输出在不超过袋子容量 V 的情况下你能取走的最多的樱花数量。

// 样例输入
// 4 8
// 1 2 3 4

// 样例输出
// 7

// 样例说明
// 在样例中我们一共可以获得 4 个长度为 1 的连续区间，所获得的收益就是每棵樱花树上的樱花个数 1，2，3，4。

// 存在 3 个长度为 2 的连续区间，收益分别是 1+2=3，2+3=5，3+4=7（不超过 8 的最优解）。

// 存在 2 个长度为 3 的连续区间，收益分别是 1+2+3=6，2+3+4=9（非法）。

// 存在 1 个长度为 4 的连续区间，收益是 1+2+3+4=10（非法）。

// 因此最优答案为 7。

#include <bits/stdc++.h>
using namespace std;

int main()
{
    int n, V;
    cin >> n >> V;
    int a[n + 1];
    int ans = 0;
    for (int i = 1; i <= n; i++)
        cin >> a[i];

    // 前缀和数组与set
    set<int> se;
    int S[n];
    S[0] = 0;
    se.insert(0);
    for (int i = 1; i <= n; i++)
    {
        S[i] = S[i - 1] + a[i];
        se.insert(S[i]);
        // cout << S[i] << ' ';
    }
    // cout << '\n';

    // S[i] - S[j] <= V (i >= j)
    // S[j] >= S[i] - V
    // 即对于每一个S[i]-V都找到最小的大于它的S[j];
    for (int i = 1; i <= n; i++)
    {
        int lower = *(se.lower_bound(S[i] - V));
        if (S[i] - lower > ans)
            ans = S[i] - lower;
    }
    cout << ans;
}