// 题目背景
// 在名为 “阿卡夏” 的维度中，漂浮着无数的记忆碎片。
// 每一片记忆都有一个独特的标签（由小写英文字母组成的字符串），以及它所蕴含的能量值。
// 你是一名记忆收藏家。你的背包是一个神奇的空间，可以容纳无限多的记忆碎片。
// 由于记忆碎片的标签不是数字，而是字符串，普通的分类法（数组）完全失效了。
// 你需要建立一个特殊的索引系统来管理它们。
// 你的背包系统需要支持
// Q
// Q 次操作：
// 收集 (Collect)：发现了一批标签为
// S
// S 的记忆碎片，数量为
// x
// x 个。你需要将它们存入背包。
// 融合 (Fuse)：为了炼制特殊道具，需要消耗标签为
// S
// S 的记忆碎片
// x
// x 个。
// 如果背包中标签为
// S
// S 的碎片数量不足
// x
// x 个（或者根本不存在），则操作失败，不消耗任何碎片。
// 如果数量足够，则扣除
// x
// x 个。
// 清点 (Check)：查询当前背包中，标签为
// S
// S 的记忆碎片还有多少个。
// 输入格式
// 第一行包含一个整数
// Q
// Q，表示操作的次数。 接下来
// Q
// Q 行，每行格式如下：
// 1 S x : 表示收集标签为
// S
// S 的碎片
// x
// x 个。
// 2 S x : 表示尝试消耗标签为
// S
// S 的碎片
// x
// x 个。
// 3 S : 表示查询标签为
// S
// S 的碎片数量。
// 其中，
// S
// S 是一个仅包含小写字母的字符串，
// x
// x 是一个正整数。
// 输出格式
// 对于操作 1，不需要输出。
// 对于操作 2，如果消耗成功（库存充足），输出剩余的碎片数量；
// 如果消耗失败（库存不足），输出 -1 。
// 对于操作 3，输出当前标签为
// S
// S 的碎片数量。如果背包里没有
// S
// S，输出 0 。
// 样例输入
// 7
// 1 fire 10
// 1 ice 5
// 3 fire
// 2 fire 3
// 2 ice 10
// 3 water
// 2 water 1
// 样例输出
// 10
// 7
// -1
// 0
// -1
// 解释：
// 存入 "fire" 10 个。
// 存入 "ice" 5 个。
// 查询 "fire" -> 10。
// 消耗 "fire" 3 个 -> 够用 (10>=3)，剩余 7 个。输出 7。
// 消耗 "ice" 10 个 -> 不够 (5<10)，失败。输出 -1。
// 查询 "water" -> 不存在。输出 0。
// 消耗 "water" 1 个 -> 不存在，失败。输出 -1。

#include <iostream>
#include <map>
#include <string>
using namespace std;

int main()
{
    map<string, long long> mp;
    long long Q, x, op;
    string s;
    cin >> Q;
    for (int i = 0; i < Q; i++)
    {
        cin >> op;
        switch (op)
        {
        case 1:
            cin >> s >> x;
            mp[s] += x;
            break;
        case 2:
            cin >> s >> x;
            if (mp.find(s) == mp.end())
            {
                cout << -1 << endl;
                break;
            }
            else
            {
                if (mp[s] < x)
                {
                    cout << -1 << endl;
                    break;
                }
                else
                {
                    mp[s] -= x;
                    cout << mp[s] << endl;
                    break;
                }
            }
        case 3:
            cin >> s;
            if (mp.find(s) == mp.end())
                cout << 0 << endl;
            else
                cout << mp[s] << endl;
            break;
        }
    }
}