// 题目背景
// 在连接现实与虚幻的缝隙中，存在着一座 “幻境拍卖行”。这里的拍品往往是稀有的记忆或梦境。

// 与普通拍卖行不同，这里的竞拍者互不可见，且经常会出现多人出价相同的情况。拍卖行的规则允许存在多个相同的出价（比如三个人都出价
// 100 金币，那么系统里就会记录 3 个 100）。

// 作为拍卖行的管理员，你需要维护当前的竞拍列表，并处理
// Q
// Q 次事务：

// 出价 (Bid)：一名竞拍者提出了
// x
// x 金币的出价。
// 撤资 (Withdraw)：由于资金不足或改变主意，一名竞拍者撤回了
// x
// x 金币的出价。
// 注意：如果有多个人出价
// x
// x，只撤回其中一个人的出价。如果当前没人出价
// x
// x，则忽略此次操作。
// 试探 (Query)：一名新来的土豪想要稳压某个价格一头。他询问：当前所有出价中，严格大于
// x
// x 的最小出价是多少？
// 输入格式
// 第一行包含一个整数
// Q
// Q，表示事务处理的次数。 接下来
// Q
// Q 行，每行包含两个整数
// o
// p
// ,
// x
// op,x。

// o
// p
// =
// 1
// op=1：表示有人出价
// x
// x。
// o
// p
// =
// 2
// op=2：表示有人撤回一个
// x
// x 的出价。
// o
// p
// =
// 3
// op=3：表示查询严格大于
// x
// x 的最小出价。
// 输出格式
// 对于每一次
// o
// p
// =
// 3
// op=3 的操作，输出一行一个整数。 如果找到了符合条件的出价，输出该价格。 如果当前没有任何出价严格大于
// x
// x，或者拍卖列表为空，请输出 -1 。

// 样例输入
// 9
// 1 100
// 1 100
// 1 50
// 3 90
// 2 100
// 3 90
// 2 100
// 3 90
// 3 120
// 样例输出
// 100
// 100
// -1
// -1
// 解释：

// 插入 100, 100, 50。当前列表：{50, 100, 100}。
// 查询 > 90 的最小数。是 100。
// 删除一个 100。当前列表：{50, 100}。
// 查询 > 90 的最小数。仍然是 100（因为还有一个）。
// 再删除一个 100。当前列表：{50}。
// 查询 > 90 的最小数。找不到，输出 -1。
// 查询 > 120 的最小数。找不到，输出 -1。
// 数据范围与评分标准
// 本题共 10 个测试点，总分 100 分。

// 测试点 1-3 (30 分):
// 1
// ≤
// Q
// ≤
// 1000
// 1≤Q≤1000，
// 1
// ≤
// x
// ≤
// 1
// 0
// 9
// 1≤x≤10
// 9
//  。
// 提示：数据量较小，可以使用数组或 list 暴力维护，删除时只删一个。
// 测试点 4-10 (70 分):
// 1
// ≤
// Q
// ≤
// 2
// ×
// 1
// 0
// 5
// 1≤Q≤2×10
// 5
//  ，
// 1
// ≤
// x
// ≤
// 1
// 0
// 9
// 1≤x≤10
// 9
//  。
// 提示：数据量较大，需要使用支持
// O
// (
// log
// ⁡
// N
// )
// O(logN) 插入、删除、查找的数据结构，且必须支持重复元素。

#include <iostream>
#include <set>
using namespace std;

int main()
{
    multiset<int> ms;
    int Q, op, x;
    cin >> Q;
    for (int i = 0; i < Q; i++)
    {
        cin >> op >> x;
        switch (op)
        {
        case 1:
            ms.insert(x);
            break;
        case 2:
        {
            auto t1 = ms.find(x);
            if (t1 != ms.end())
                ms.erase(t1);
            break;
        }
        case 3:
        {
            auto t2 = ms.upper_bound(x);
            if (t2 != ms.end())
                cout << *t2 << endl;
            else
                cout << -1 << endl;
            break;
        }
        }
    }
}