// 题目背景
// 在探索未知的"黑暗扇区"时，你的飞船接收到了海量的宇宙背景辐射信号。这些信号源源不断地到达，每一个信号都有一个强度值（整数）。
// 为了筛选出有价值的信息，舰载主机设置了一个过滤器：我们只关注当前接收到的所有信号中，强度第 K 小的那个信号。
// 为什么是第 K 小？因为强度太小的往往是噪音，强度太大的往往是恒星干扰，只有处于特定排位的信号才可能包含智慧生命的编码。
// 你需要编写一个程序，模拟信号的接收过程。一开始，信号库是空的。接下来会有 N 次事件，事件分为两种：
// 接收 (Receive)：捕捉到一个强度为 x 的新信号。
// 分析 (Analyze)：输出当前已接收的所有信号中，强度第 K 小的数值。
// 输入格式
// 第一行包含两个整数 N 和 K。N 表示事件总数，K 表示我们需要关注的排名。
// 接下来 N 行，每行包含两个整数 op, x。
// op = 1：表示接收到一个强度为 x 的信号。
// op = 2：表示进行一次分析询问（此时忽略输入的 x）。
// 输出格式
// 对于每一次 op = 2 的询问，输出一行一个整数。如果当前接收到的信号不足 K 个，无法确定第 K 小，请输出 -1。否则，输出第 K
// 小的信号强度。

// 样例输入
// 9 3
// 1 10
// 1 5
// 2 0
// 1 20
// 2 0
// 1 3
// 2 0
// 1 7
// 2 0
// 样例输出
// -1
// 20
// 10
// 7

#include <bits/stdc++.h>
using namespace std;
int main()
{
    priority_queue<int> pq;
    int n, k, op, x;
    cin >> n >> k;
    for (int i = 0; i < n; i++)
    {
        cin >> op >> x;
        switch (op)
        {
        case 1:
            if (pq.size() < k)
                pq.push(x);
            else
            {
                if (x < pq.top())
                {
                    pq.pop();
                    pq.push(x);
                }
            }
            break;
        case 2:
            if (pq.size() < k)
            {
                cout << -1 << '\n';
                break;
            }
            else
            {
                cout << pq.top() << '\n';
                break;
            }
        }
    }
}