// 题目背景
// 人类终于制造出了第一台通用量子计算机 ——“深蓝核心”。
// 但这台计算机目前只有一个量子处理单元（QPU）。
// 这就意味着，尽管它算力无穷，但同一时刻只能处理一个任务。
// 为了公平起见，系统工程师设计了一套 “时间片轮转” 的调度协议：
// 所有等待执行的任务按照到达顺序排成一个队列。
// QPU 设定了一个标准的时间片长度
// Q
// Q（毫秒）。
// 每次 QPU 从队列头部取出一个任务进行处理。
// 如果该任务所需时间
// T
// ≤
// Q
// T≤Q，则它能在本轮执行完毕。QPU 处理它
// T
// T 毫秒，该任务结束，记录其完成时间。
// 如果该任务所需时间
// T
// >
// Q
// T>Q，则 QPU 只会处理它
// Q
// Q 毫秒。处理完后，该任务的剩余所需时间变为
// T
// −
// Q
// T−Q，并被立刻重新放回队列的尾部等待下一轮。
// 重复上述过程，直到队列为空。
// 现在给出了
// N
// N 个任务的名称和所需时间，以及时间片
// Q
// Q。请你模拟这个过程，
// 按任务完成的先后顺序输出每个任务的名称和它结束时的总耗时。
// 输入格式
// 第一行包含两个整数
// N
// N 和
// Q
// Q，分别表示任务数量和时间片长度。 接下来
// N
// N 行，每行包含一个字符串
// N
// a
// m
// e
// Name 和一个整数
// T
// i
// m
// e
// Time，表示任务名称和所需总时间。（字符串不含空格）。 初始时，任务按照输入的顺序进入队列。

// 输出格式
// 输出
// N
// N 行。 每行包含两个信息：任务名称
// N
// a
// m
// e
// Name 和该任务结束时的系统总耗时（从 0 开始累计），中间用空格隔开。

// 样例输入
// 5 100
// p1 150
// p2 80
// p3 200
// p4 350
// p5 20
// 样例输出
// p2 180
// p5 400
// p1 450
// p3 550
// p4 800

#include <iostream>
#include <queue>
using namespace std;

int main()
{
    int n, Q;
    queue<string> qn;
    queue<int> qt;
    string s;
    int t, count = 0;
    cin >> n >> Q;
    for (int i = 0; i < n; i++)
    {
        cin >> s >> t;
        qn.push(s);
        qt.push(t);
    }
    while (!qn.empty())
    {
        int x = qt.front();
        if (x > Q)
        {
            qt.front() -= Q;
            qt.push(qt.front());
            qt.pop();
            qn.push(qn.front());
            qn.pop();
            count += Q;
        }
        else
        {
            count += qt.front();
            cout << qn.front() << ' ' << count << '\n';
            qt.pop();
            qn.pop();
        }
    }
}