// 题目背景
// 在被遗忘的荒原上，矗立着一排古老的魔法守望塔。这些守望塔自西向东排列，编号依次为 1 到 N。每座塔都有一个特定的高度Hi。
// 为了传递警报，每座守望塔都会向东方（即编号增大的方向）发射水平的魔法信号。 然而，魔法信号无法穿透实体。
// 这意味着，从第 i 号塔发出的信号，只能被位于其东侧、且高度严格大于 Hi 的第一座塔所接收。
// 如果东侧不存在比它高的塔，信号就会消散在虚空中。
// 作为守望者军团的指挥官，你需要计算出每一座塔发出的信号最终会被哪一座塔接收。
// 输入格式
// 第一行包含一个整数 N，表示守望塔的数量。
// 第二行包含 N 个整数 H1, H2, ..., HN，依次表示每座塔的高度。
// 输出格式
// 输出一行 N 个整数。第 i 个整数表示第 i 号塔的信号接收塔的编号。
// 如果信号无法被接收（即东侧没有更高的塔），则输出 0。整数之间用空格分隔。
// 样例输入
// 5
// 4 2 3 5 1
// 样例输出
// 4 3 4 0 0

#include <bits/stdc++.h>
using namespace std;
int main()
{
    stack<int> s;
    int n, h;
    cin >> n;
    vector<int> v(n + 1);
    vector<int> ans(n + 1);
    for (int i = 1; i <= n; i++)
    {
        cin >> h;
        v[i] = h;
        if (s.empty())
            s.push(i);
        else
        {
            while (h > v[s.top()])
            {
                ans[s.top()] = i;
                s.pop();
                if (s.empty())
                {
                    s.push(i);
                    break;
                }
            }
            s.push(i);
        }
    }
    if (!s.empty())
    {
        while (!s.empty())
        {
            ans[s.top()] = 0;
            s.pop();
        }
    }
    for (int i = 1; i <= n; i++)
        cout << ans[i] << ' ';
}