// 给定 n 个正整数组成的数列 a1, a2, ⋯, an 和 m 个区间 [li, ri]，分别求这 m 个区间的区间和。

// 输入格式

// 第一行包含一个正整数 n，表示序列的长度。
// 第二行包含 n 个正整数 a1, a2, ⋯, an。
// 第三行包含一个正整数 m，表示区间的数量。
// 接下来 m 行，每行包含两个正整数 li, ri，满足 1 ≤ li ≤ ri ≤ n。

// 输出格式

// 共 m 行，其中第 i 行包含一个正整数，表示第 i 组答案的询问。

// 输入输出样例

// 输入 #1

// 4
// 4 3 2 1
// 2
// 1 4
// 2 3

// 输出 #1

// 10
// 5

// 说明/提示

// 样例解释
// 第 1 到第 4 个数加起来和为 10。第 2 个数到第 3 个数加起来和为 5。

// 数据范围
// 对于 50% 的数据：n, m ≤ 1000；
// 对于 100% 的数据：1 ≤ n, m ≤ 10^5，1 ≤ ai ≤ 10^4。

#include <bits/stdc++.h>
using namespace std;

int main()
{
    int n, li, ri;
    cin >> n;
    int a[n + 1];
    for (int i = 1; i <= n; i++)
        cin >> a[i];
    cin >> li >> ri;
    int s[n + 1];
    s[0] = 0;
    // s[1] = a[1];
    for (int i = 2; i <= n; i++)
        s[i] = s[i - 1] + a[i];
    // cout << s[ri] << endl;
    // cout << s[li] << endl;
    cout << s[ri] - s[li - 1];
}