// 题目描述
// 一个整数如果按从低位到高位的顺序，奇数位（个位、百位、万位……）上的数字是奇数，偶数位（十位、千位、十万位……）上的数字是偶数，我们就称之为"好数"。
// 给定一个正整数 N，请计算从 1 到 N 一共有多少个好数。
// 输入格式
// 一个整数 N。
// 输出格式
// 一个整数代表答案。
// 输入输出样例
// 输入 #1
// 24
// 输出 #1
// 7
// 输入 #2
// 2024
// 输出 #2
// 150
// 说明/提示
// 样例 1 解释
// 24 以内的好数有 1,3,5,7,9,21,23，一共 7 个。
// 数据规模与约定
// 对于 10% 的测试数据，1≤N≤100。
// 对于全部的测试数据，1≤N≤10^7。
#include <bits/stdc++.h>
using namespace std;
int main()
{
    int N;
    cin >> N;
    int ans = 0;
    for (int i = 1; i <= N; i++)
    {
        int j = i;
        int count = 1;
        while (j != 0)
        {
            int current = j % 10;
            // 奇数位
            if (count % 2 != 0)
            {
                if (current % 2 == 0)
                    break;
                else
                {
                    j /= 10;
                    count++;
                }
            }
            // 偶数位
            else
            {
                if (current % 2 != 0)
                    break;
                else
                {
                    j /= 10;
                    count++;
                }
            }
        }
        if (j == 0)
            ans++;
    }
    cout << ans;
}