// P2144 统计字符个数
// 题目描述
// 给你一个包含 n 个英文字符的字符串，以及 q 次询问，每次询问一个字符的出现次数。

// 输入描述
// 输入第一行包含两个正整数 n 和 q，用空格隔开，分别表示字符串中的字符个数和询问次数。

// 第二行是一个包含 n 个英文小写字符的字符串。

// 接下来 q 行，每行一个英文小写字符，表示 q 次询问。

// 输出描述
// 输出 q 行，每行一个整数，第 i 行输出的是第 i 次询问的字符在字符串中出现的次数。

// 数据规模
// 对于前两个测试点，1≤q,n≤10。

// 对于全部测试点，1≤q,n≤10^5。

// 样例输入
// 10 3
// abcdabcdef
// a
// f
// z

// 样例输出
// 2
// 1
// 0

#include <bits/stdc++.h>
using namespace std;

int main()
{
    map<char, int> mp;
    string s;
    int n, q;
    char op;
    cin >> n >> q >> s;
    for (char c : s)
        mp[c]++;
    while (q--)
    {
        cin >> op;
        cout << mp[op] << '\n';
    }
}
