// 题目描述
// 小苯有一个长度为 n 的数组 a，同时他还另有一个长度也为 n 的字符串 S，
// 仅由 '<'、'>' 和 'Z' 三种字符组成。串 S 恰好是用来"匹配"数组 a 的，具体规则如下：
// - 如果 S[i] = '<'，则必须有 a[i] < 0。
// - 如果 S[i] = '>'，则必须有 a[i] > 0。
// - 如果 S[i] = 'Z'，则必须有 a[i-1] * a[i] > 0（即 a[i-1] 与 a[i] 同号），
// 其中 1 < i <= n。
// 然而，现在的数组 a 并不一定满足 S 的匹配要求，因此小苯需要进行修改操作：
// 每次可以选择某个 a[i]，将其修改为任意整数 x（-10^9 <= x <= 10^9）。
// 现在，小苯想知道他至少需要多少次修改，才能使得数组 a 满足 S 的匹配要求。
// 输入描述
// 本题有多组测试数据。
// 第一行包含一个正整数 T（1 <= T <= 100），表示数据组数。
// 每组数据格式如下：
// - 第一行：一个正整数 n（1 <= n <= 2×10^5），表示数组 a 和串 S 的长度。
// - 第二行：n 个整数 a[i]（-10^9 <= a[i] <= 10^9），表示数组 a。
// - 第三行：一个长度为 n 的字符串 S（仅由 '<'、'>' 和 'Z' 构成）。
// 保证所有测试数据中 n 的总和不超过 2×10^5。特别地，保证 S[1] != 'Z'。
// 输出描述
// 对于每组测试数据，在单独的一行输出一个整数，表示最少的修改次数。
// 示例
// 输入：
// 2
// 6
// -1 4 -6 3 2 -11
// >Z<>>Z
// 4
// 1 1 1 1
// >ZZ
// 输出：
// 2
// 1
// 说明：
// 对于第一组测试数据：修改 a[1]=3 和 a[6]=1 即可，共两次操作。
// 对于第二组测试数据：修改 a[4]=-9 即可，共一次操作。
#include <iostream>
#include <vector>
using namespace std;

int main()
{
    int n, t;
    char c;
    vector<int> a;
    vector<char> s;
    cin >> n;
    for (int i = 0; i < n; i++)
    {
        cin >> t;
        a.push_back(t);
    }
    for (int i = 0; i < n; i++)
    {
        cin >> c;
        s.push_back(c);
    }
    for (int i = 1; i < n; i++)
    {
        if (s[i] == 'Z')
            s[i] = s[i - 1];
    }
    // for (int i = 0; i < n; i++)
    // {
    //     cout << s[i];
    // }
    int count = 0;
    for (int i = 0; i < n; i++)
    {
        if (s[i] == '<')
        {
            if (a[i] < 0)
                continue;
            else
                count++;
        }
        if (s[i] == '>')
        {
            if (a[i] > 0)
                continue;
            else
                count++;
        }
    }
    cout << count;
}